1. Да, существуют. Когда один модуль представляет некий интерфейс для использования другими модулями
2. Метрики для количественной оценки принципов организации модулей:
а) Высокая связность между методами модуля. Для оценки того, что модуль отвечает за одну функцию
б) Низкая связность между модулями. Для оценки того, что модули не пересекаются по функционалу
в) Независимость модулей. Объём функциональности модуля, который сохраняется в отрыве от контекста
3. Среди задач, которые ещё остались в памяти, есть только те, в которых количество классов сильно больше, чем 3-5.