# Наследование подтипов
# Родительский класс – "Птица". Классы-наследники – это, например "Водоплавающая птица", "Перелётная птица" или "Хищная птица".


# Наследование с ограничением
# Ресторан – родительский класс. Наследники – "Ресторан быстрого питания", "Вегетарианский ресторан", "Ресторан мексиканской кухни".
# Каждый из них вводит дополнительное ограничение по типу блюд.


# Наследование с расширением
# Родительский класс – "Текстовый редактор". Его принципиально расширяют классы-потомки. Например, "IDE" или "Редактор для научных публикаций".