# Родительский класс: Велосипед.
#
# Классификация:
#
# По типу велосипеда (Горный, Шоссейный, Городской, BMX, Трековый).
# По типу рамы (Алюминиевая, Углеродная, Стальная).
# Описание иерархии:
#
# Горный велосипед:
# Алюминиевый горный велосипед
# Углеродный горный велосипед
# Стальной горный велосипед

# Шоссейный велосипед:
# Алюминиевый шоссейный велосипед
# Углеродный шоссейный велосипед
# Стальной шоссейный велосипед
# Городской велосипед:
# Алюминиевый городской велосипед
# Углеродный городской велосипед
# Стальной городской велосипед

# BMX:
# Алюминиевый BMX
# Углеродный BMX
# Стальной BMX

# Трековый велосипед:
# Алюминиевый трековый велосипед
# Углеродный трековый велосипед
# Стальной трековый велосипед


# Пояснение:
# Это пример наследования вида, так как велосипеды классифицируются и по типу, и по материалу рамы.